/* 

*/

// const завжди для масивів!!!

const array = ['a', 'b', 'c', 'd'];
console.log(array);
console.table(array);

// table виводить в консоль масив у вигляді таблиці

const lastIndex = array.length - 1;
console.log(lastIndex)

console.log(`елемент масиву з індексом 1 -` ,array[1])

array[1] = 'de'
console.table(array)

array[3] = 10041990;
console.table(array);


// передача по значенню:

let a = 10;
let b = a;
a = 3;
console.log(a, b)

/*
фактично для змінної б створюється копія змінної а, яка не змінюється синхронно з а
*/



// передача по посиланню, поінтер, працює зі складними типами (масиви і т д)

const c = [1, 2, 3];
const d = c;


console.log(`c`, c);
console.log(`d`, d);

c[0] = 500;

console.log(`c`, c);
console.log(`d`, d);
 
/*
фактично смінна с і змінна d  зберігають в собі посилання на один і той самий масив, тому 
при зміні елементу масиву змінни фіксуються у обох змінних

порівняння складних типів відбувається по осередку(ячейка) пам'яті, а не по значеннях (по 
адресі посилання на ці осередки):
*/

console.log(c === d);
console.log([1, 2, 3] === [1, 2, 3]);

