/* напиши скрипт обробки купівлі в магазині:
-баланс користувача у змінній balance
-сума покупки у змінній payment
-перед перевіркою вивести повідомлення: 
"Загальна сума замовлення 'payment' кредитів. Перевіряємо кількість доступних коштів на рахунку"
 -якщо сума покупки менша за баланс - відняти суму покупки 
 і вивести повідомлення 
 "На рахунку залишилось (залишок) кредитів"
 -якщо сума покупки більша за баланс - вивести повідомлення
 "На рахунку недостатньо коштів для проведення операції"
 -в кінці вивести повідомлення 
 "Операція завершена"*/

const balance = 1000
;
const payment = 500;
let message;
let result;

message = `Загальна сума замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`;
console.log(message);
if(payment <= balance) {
    result = balance - payment;
    message = `На рахунку залишилось ${result} кредитів`;
console.log(message);
} else {
    message = `На рахунку недостатньо коштів для проведення операції`;
    console.log(message);
}
console.log(`Операція завершена`)

// АБО

result = balance - payment;
message = `Загальна сума замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`;
console.log(message);

message = payment <= balance ? `На рахунку залишилось ${result} кредитів` : `На рахунку недостатньо коштів для проведення операції`;
console.log(message);
console.log(`Операція завершена`);

// АБО

result = balance - payment;
console.log(`Загальна сума замовлення ${payment} кредитів. Перевіряємо кількість доступних коштів на рахунку`);
if(payment <= balance) {
console.log(`На рахунку залишилось ${result} кредитів`);
} else {
    console.log(`На рахунку недостатньо коштів для проведення операції`);
}
console.log(`Операція завершена`)
