/* написати скрипт вибору опції доставки товару.
Опція зберігається у змінній option:
1 - самовивіз
2 - кур'єр
3 - пошта

у змінну message записвти повідомлення в залежності від опції :
`Ви зможете забрати товар завтра з 12:00 у нащому офісі`
`Кур'єр доставить товар застра з 9:00 до 18:00`
`Посилка буде відправлена сьогодні`
`Вам передзвонить менеджер`*/

const option = 4;
let message = `Вам передзвонить менеджер`;

switch (option) {
  case 1:
    message = `Ви зможете забрати товар завтра з 12:00 у нашому офісі`;
    break;

  case 2:
    message = `Кур'єр доставить товар застра з 9:00 до 18:00`;
    break;

  case 3:
    message = `Посилка буде відправлена сьогодні`;
    break;

  default:
    message;
}

console.log(message);
